Description: Downloads, packages and uploads to Jamf the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.jamf.FoxitPDFEditorPATCH
ParentRecipe: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor
  CATEGORY: Applications
  GROUP_NAME: AutoPkg - FoxitPDF-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Regex.xml
  POLICY_CATEGORY: Applications
  POLICY_NAME: Update %NAME%
  SELF_SERVICE_DISPLAY_NAME: Update %NAME%
  SELFSERVICE_ICON: FoxitPDF.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: 'Policy_update-smart-Login-Once-NOselfservice.xml'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
    SELF_SERVICE_DESCRIPTION: 'Installs the Latest Patch for %NAME%

    Version: *%version%*'