Description: Download recipe for the latest Patch version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: https://cdn01\\.foxitsoftware\\.com/pub/foxit/phantomPDF/desktop/mac/13\\.x/(.*\.pkg)
    result_output_var_name: url
    url: https://kb.foxit.com/hc/en-us/articles/22269520193044-How-to-Patch-Update-Foxit-PDF-Editor-Reader-for-MAC

- Processor: URLDownloader
  Arguments:
    prefetch_filename: 'true'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Foxit Corporation (8GN47HTP75)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'