Description: Downloads and makes a pkg for the latest version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.pkg.FoxitPDFEditor
ParentRecipe: com.github.5kinner-recipes.download.FoxitPDFEditor
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/foxit.pkg/payload"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/IBM*/SPSS Statistics.app/Contents/Info.plist"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%found_filename%"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/SPSS*/*.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/expanded"