Description: Download recipe for the latest Patch version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor PATCH

Process:
- Processor: URLDownloader
  Arguments:
    url: https://cdn01.foxitsoftware.com/pub/foxit/phantomPDF/desktop/mac/13.x/13.1.4/FoxitPDFEditor1314Upd.L10N.pkg 

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Foxit Corporation (8GN47HTP75)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'