Description: Downloads and makes a pkg for the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH

MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor PATCH

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/payload"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/Library/PDF Services/Save as Foxit PDF.app/Contents/Info.plist"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%found_filename%"
      plist_version_key: CFBundleShortVersionString

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/expanded"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"