Description: Downloads and makes a pkg for the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH
ParentRecipe: com.github.5kinner-recipes.download.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor PATCH

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader
    Arguments:
      source_pkg: "%pathname%"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"