Description: Downloads, packages and uploads to Jamf the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.jamf.FoxitPDFEditorPATCH
ParentRecipe: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor
  CATEGORY: Applications
  GROUP_NAME: AutoPkg - FoxitPDF-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Regex.xml
  POLICY_CATEGORY: Applications
  CUSTOM_TRIGGER: Trigger
  SCRIPT_NAME: Script
  PARA_4: Para4
  PARA_5: Para5
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: 'Update %NAME%'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: 'Policy_update-smart-Login-Custom-Once.xml'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: 'Update %NAME% - If Not Running'
    policy_category: '%POLICY_CATEGORY%'
    policy_template: 'dev_Policy_update-smart-Script-Custom-Trigger.xml'
    replace_policy: "True"
