Description: Download recipe for the latest version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditorTEST
MinimumVersion: 2.3

Input:
  NAME: Foxit PDF Editor

Process:
- Processor: URLDownloader
  Arguments:
    url: https://www.foxit.com/downloads/latest.html?product=Foxit-PhantomPDF-Mac&platform=Mac-OS-X&version=&package_type=pkg&language=ML