Description: Download recipe for the latest version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditor
MinimumVersion: 2.3

Input:
  NAME: Foxit PDF Editor

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: https://www.foxit.com/downloads/latest.html?product=Foxit-Editor&platform=Mac-OS-X&version=&package_type=&distID=


