Description: Downloads and makes a pkg for the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH
ParentRecipe: com.github.5kinner-recipes.download.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor PATCH

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/payload"

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%pathname%"