Description: Download recipe for the latest version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditor
MinimumVersion: 2.3

Input:
  NAME: Foxit PDF Editor

Process:
- Processor: URLDownloader
  Arguments:
    url: 'https://www.foxit.com/downloads/latest.html?product=Foxit-PhantomPDF-Mac&platform=Mac-OS-X&version=&package_type=pkg&language=ML'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Foxit Corporation (8GN47HTP75)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'