Description: Download recipe for the latest Patch version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.download.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: https://cdn01\.foxitsoftware\.com/pub/foxit/phantomPDF/desktop/mac/13\.x/13\..*?/FoxitPDFEditor.*Upd\.L10N\.pkg
    result_output_var_name: url
    url: https://kb.foxit.com/hc/en-us/articles/22269520193044-How-to-Patch-Update-Foxit-PDF-Editor-Reader-for-MAC
    curl_opts: 
    - "-A "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3.1 Safari/605.1.15""

- Processor: URLDownloader
  Arguments:
    prefetch_filename: 'true'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Foxit Corporation (8GN47HTP75)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'