Description: Downloads, packages and uploads to Jamf the latest PATCH version of Foxit PDF Editor.
Identifier: com.github.5kinner-recipes.jamf.FoxitPDFEditorPATCH
ParentRecipe: com.github.5kinner-recipes.pkg.FoxitPDFEditorPATCH
MinimumVersion: '2.3'

Input:
  NAME: Foxit PDF Editor
  CATEGORY: My Applications
  TESTER_USERNAME: TESTING
  AD_GROUP: AD Group
  POLICY_CATEGORY: Applications
  POLICY_NAME: Update %NAME%
  POLICY_TEMPLATE: Policy_selfservice_AD_Group.xml
  SELF_SERVICE_DISPLAY_NAME: Update %NAME%
  SELFSERVICE_ICON: FoxitPDF.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
    SELF_SERVICE_DESCRIPTION: 'Installs the Latest Patch for %NAME%

    Version: *%version%*'