Description: Downloads the Staged version of FlexPLM from a local file share and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.FlexPLM
ParentRecipe: com.github.5kinner-recipes.download.FlexPLM
MinimumVersion: '2.3'

Input:
  NAME: FlexPLM

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%found_filename%"
