Description: Downloads the Staged version of Fiery Software Manager from a local file share and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.Clementine
ParentRecipe: com.github.5kinner-recipes.download.Clementine
MinimumVersion: '2.3'

Input:
  NAME: Fiery Software Manager

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%found_filename%/*.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
