Description: Downloads the Staged version of FileOnDemand from a local file share and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.FileOnDemand
ParentRecipe: com.github.5kinner-recipes.download.FileOnDemand
MinimumVersion: '2.3'

Input:
  NAME: File On Demand

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: "%found_filename%"
