Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.upload.AmazonCorettoJDK11
ParentRecipe: com.github.rtrouton.pkg.amazoncorettojdk11
MinimumVersion: '2.3'

Input:
  CATEGORY: Applications

Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
