Description: Downloads the speficed Tabelau Desktop version and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.TableauProduct
ParentRecipe: com.github.5kinner-recipes.download.TableauProduct
MinimumVersion: '2.3'

Input:
  NAME: Tableau 
  PRODUCT: Prep

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%/*.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Tableau App.pkg/payload"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/Tableau %PRODUCT% Builder 2023.1.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%PRODUCT%-v%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unpack/Tableau App.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"
