Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.VLC
ParentRecipe: com.github.autopkg.pkg.VLC
MinimumVersion: '2.3'

Input:
  NAME: VLC
  CATEGORY: Applications
  GROUP_NAME: AutoPkg_VLC-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Testing_Regex.xml
  TESTING_GROUP_NAME: Testers
  POLICY_CATEGORY: Auto Updating
  POLICY_NAME: AutoPkg Auto Install Latest %NAME%
  POLICY_TEMPLATE: Policy_update-smart-NOselfservice.xml
  POLICY_CATEGORY2: Applications
  POLICY_NAME2: Install Latest %NAME%
  POLICY_TEMPLATE2: Policy_selfservice_AllComputers.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: VLC.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME2%'
    policy_category: '%POLICY_CATEGORY2%'
    policy_template: '%POLICY_TEMPLATE2%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
