Description: Downloads and packages the Staged version of Fiery Software Manager from a local file share.
Identifier: com.github.5kinner-recipes.pkg.FierySoftwareManager
ParentRecipe: com.github.5kinner-recipes.download.FierySoftwareManager
MinimumVersion: '2.3'

Input:
  NAME: FierySoftwareManager

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%found_filename%/*.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
