Description: Downloads and packages the Staged version of Fiery Software Manager from a local file share.
Identifier: com.github.5kinner-recipes.pkg.FierySoftwareManager
ParentRecipe: com.github.5kinner-recipes.download.FierySoftwareManager
MinimumVersion: '2.3'

Input:
  NAME: FierySoftwareManager

Process:
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/downloads/Fiery-Software-Manager mac/Fiery/Fiery-Software-Manager/Fiery Software Manager.dmg/Fiery Software Manager.app/Contents/info.plist'

- Processor: AppPkgCreator
  Arguments:
    version: '%version%'
    app_path: "%found_filename%/*.app"
    pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
