Description: Downloads the latest verison of AutoCAD from a local file.
Identifier: com.github.5kinner-recipes.download.AutoCADLT

Input:
  NAME: AutoCAD LT
  FILE_NAME_SEARCH_TERM: AutoCAD_LT
  PATH_TO_DMG: /path/to/dmg
  VERSION_YEAR: 2024

Process:
- Processor: FileFinder
  Arguments:
    pattern: '%PATH_TO_DMG%/*%FILE_NAME_SEARCH_TERM%*.dmg'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%found_filename%/*.app'
    requirement: 'identifier "com.autodesk.AutoCADLT%VERSION_YEAR%.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y'

- Processor: EndOfCheckPhase
