Description: Downloads and packages AutoCAD with built-in licensing information
Identifier: com.github.5kinner-recipes.pkg.AutoCADLT
ParentRecipe: com.github.5kinner-recipes.download.AutoCADLT

Input:
  NAME: AutoCAD LT
  FILE_NAME_SEARCH_TERM: AutoCAD_LT
  VERSION_YEAR: 2024
  PRODUCT_KEY: ''
  EULA_LOCALE: GB
  SERIAL_NUMBER: ''
  LIC_SERVER: ''
  PATH_TO_DMG: /path/to/dmg

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      root/private/tmp: '0777'
    pkgroot: '%RECIPE_CACHE_DIR%/payload'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/root/private/tmp/%NAME%.app'
    source_path: '%found_filename%/*.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      id: com.autodesk.AutoCADLT%VERSION_YEAR%
      pkgname: '%NAME%-%VERSION_YEAR%'
      pkgroot: '%RECIPE_CACHE_DIR%/payload/root'
      version: '%VERSION_YEAR%'
