Description: Downloads and packages AutoCAD with built-in licensing information
Identifier: com.github.5kinner-recipes.pkg.AutoCADLT
ParentRecipe: com.github.5kinner-recipes.download.AutoCADLT

Input:
  NAME: AutoCAD
  PKG_NAME: 'AutoCAD #MAJOR_VERSION#'

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      tmp: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/scripts'

- Processor: FileMover
  Arguments:
    source: '%RECIPE_CACHE_DIR%/%app_name%'
    target: '%RECIPE_CACHE_DIR%/pkgroot/tmp/%app_name%'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: wheel
        path: tmp
        user: root
    id: 'com.autodesk.AutoCADLT2025.StandAlone.installer'
    pkgname: '%NAME%-%version%'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
    pkgtype: flat
    scripts: scripts
    version: '%version%'

- Processor: com.github.mlbz521.SharedProcessors/InputVariableTextSubstituter
  Arguments:
    original_string: '%PKG_NAME%'
    return_variable: PKG_NAME
    string_to_replace: '#MAJOR_VERSION#'
    variable_to_use: major_version

- Processor: com.github.mlbz521.SharedProcessors/RenamePath
  Arguments:
    new_name: '%RECIPE_CACHE_DIR%/%PKG_NAME%-%version%.pkg'
    source_path: '%pkg_path%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
    - '%RECIPE_CACHE_DIR%/scripts'
