Description: Downloads the latest verison of AutoCAD from a local file.
Identifier: com.github.5kinner-recipes.download.AutoCADLT

Input:
  NAME: AutoCAD LT
  FILE_NAME_SEARCH_TERM: AutoCAD_LT
  PATH_TO_DMG: /path/to/dmg
  VERSION_YEAR: 2024

Process:
- Processor: FileFinder
  Arguments:
    pattern: '%PATH_TO_DMG%/*%FILE_NAME_SEARCH_TERM%*.dmg'

- Processor: EndOfCheckPhase
