Description: Downloads the latest version of the Logi Options+ installer app, and creates a package. This package
  deploys the installer to /tmp in then installs the app silently.
Identifier: com.github.5kinner-recipes.jamf.LogitechOptionsPlus
ParentRecipe: com.github.wegotoeleven-recipes.pkg.LogiOptionsPlus
MinimumVersion: '2.3'

Input:
  NAME: Logitech Options+
  CATEGORY: Applications
  POLICY_CATEGORY: Applications
  POLICY_NAME: Install Latest %NAME%
  TARGET_GROUP_NAME: Corporate Machine
  POLICY_TEMPLATE: Policy_selfservice_TargetGroup_withRunCommand.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELFSERVICE_ICON: LogiOptions2022.png
  POLICY_RUN_COMMAND: 'chown -R "$(stat -f%Su /dev/console):admin" "/Applications/%NAME%.app" && echo "Corrected permissions for %NAME%."'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
    SELF_SERVICE_DESCRIPTION: 'Installs the Latest Version %NAME%


    Version: *%version%*'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    versions_to_keep: 2