Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.upload.CitrixWorkspace
ParentRecipe: com.github.grahampugh.recipes.pkg.CitrixWorkspace
MinimumVersion: '2.3'

Input:
  CATEGORY: Applications

Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "Citrix Workspace"
