Description: Downloads and creates a PKG of IntelliJ CE then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.IntelliJ
ParentRecipe: com.github.bnpl.autopkg.download.intellijideace
MinimumVersion: '2.3'

Input:
  NAME: IntelliJ

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: "%pathname%/*.app"