Description: Downloads and creates a PKG of Charles Proxy then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: Charles Proxy

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: \d+.\d+.\d+
    url: https://www.charlesproxy.com/latest.do
    result_output_var_name: url

- Processor: URLDownloader
  Arguments:
    url: https://www.charlesproxy.com/assets/release/%url%/charles-proxy-%url%.dmg

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: XK72 Limited (9A5PCU4FSD)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    re_pattern: "[0-9]+.[0-9]+-[0-9]+"
    result_output_var_name: "version"
    text_in: "%pathname%"

- Processor: EndOfCheckPhase
