Description: Downloads and creates a PKG of Charles Proxy then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: Charles Proxy

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: \d+.\d+.\d+
    url: https://www.charlesproxy.com/latest.do
    result_output_var_name: url
    curl_opts: ["-data-binary", -A "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3.1 Safari/605.1.15"]

- Processor: URLDownloaderPython
  Arguments:
    url: https://www.charlesproxy.com/assets/release/%url%/charles-proxy-%url%.dmg

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: XK72 Limited (9A5PCU4FSD)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    re_pattern: "[0-9]+.[0-9]+-[0-9]+"
    result_output_var_name: "version"
    text_in: "%pathname%"

- Processor: EndOfCheckPhase
