Description: Downloads and creates a PKG of Charles Proxy then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: Charles Proxy
  SEARCH_URL: https://www.charlesproxy.com/download/latest-release/
  SEARCH_PATTERN: (/assets/release/\d+\.\d+\.\d+/charles-proxy-\d+\.\d+\.\d+\.dmg*)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: /assets/release/\d+\.\d+\.\d+/charles-proxy-\d+\.\d+\.\d+\.dmg.*\b
    result_output_var_name: url
    url: https://www.charlesproxy.com/download/latest-release/
    curl_opts: [-A "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3.1 Safari/605.1.15"]

- Processor: URLDownloaderPython

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Anaconda, Inc (Z5788K4JT7)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'