Description: Downloads and creates a PKG of Charles Proxy then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.CharlesProxy
MinimumVersion: '2.3'

Input:
  NAME: Charles Proxy
  SEARCH_URL: https://www.charlesproxy.com/latest.do
  SEARCH_PATTERN: (/assets/release/\d+\.\d+\.\d+/charles-proxy-\d+\.\d+\.\d+\.dmg*)

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: https://www.charlesproxy.com/assets/release/\d+\.\d+\.\d+/charles-proxy-\d+\.\d+\.\d+\.dmg*
    result_output_var_name: url
    url: https://www.charlesproxy.com/latest.do
    curl_opts: [-A "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.3.1 Safari/605.1.15"]

- Processor: URLDownloaderPython

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_PATTERN%'
    url: '%SEARCH_URL%'

- Processor: URLDownloader
  Arguments:
    url: 'https://www.charlesproxy.com/%match%'

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Anaconda, Inc (Z5788K4JT7)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    re_pattern: "[0-9]+.[0-9]+-[0-9]+"
    result_output_var_name: "version"
    text_in: "%pathname%"

- Processor: EndOfCheckPhase
