Description: Downloads the latest version of Snagit.
Identifier: com.github.5kinner-recipes.download.Snagit
MinimumVersion: '2.3'

Input:
  NAME: Snagit
  RELEASE: '2025'

Process:
- Processor: URLDownloader
  Arguments:
    url: https://download.techsmith.com/snagitmac/releases/Snagit.dmg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/%NAME%.app'
    requirement: 'identifier "com.TechSmith.Snagit" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = 7TQL462TU8'
