Description: Downloads the INstaller and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.Snagit
ParentRecipe: com.github.ahousseini-recipes.download.Snagit
MinimumVersion: '2.3'

Input:
  NAME: Snagit

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%pathname%/%NAME%.app"
