Description: Copies pkg out of DMG
Identifier: com.github.5kinner-recipes.pkg.CLO
ParentRecipe: com.github.5kinner-recipes.download.CLO
MinimumVersion: '2.3'

Input:
  NAME: CLO 3D

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%found_filename%/*.app"
