Description: Copies pkg out of DMG
Identifier: com.github.5kinner-recipes.pkg.CLO
ParentRecipe: com.github.5kinner-recipes.download.CLO
MinimumVersion: '2.3'

Input:
  NAME: CLO 3D

Process:
  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: "[0-9]+_[0-9]+_[0-9]+"
      result_output_var_name: "version"
      text_in: "%found_filename%"

  - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
    Arguments:
      find: "_"
      input_string: "%version%"
      replace: "."

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%found_filename%/*.app"
