<?xml version="1.0" encoding="UTF-8"?>
    <policy>
        <general>
            <name>%policy_name%</name>
            <enabled>true</enabled>
            <frequency>Ongoing</frequency>
            <category>
                <name>%POLICY_CATEGORY%</name>
            </category>
        </general>
        <scope>
            <all_computers>false</all_computers>
            <computers/>
            <computer_groups/>
        </scope>
        <self_service>
            <use_for_self_service>true</use_for_self_service>
            <self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
            <install_button_text>Install</install_button_text>
            <reinstall_button_text>Install</reinstall_button_text>
            <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
            <force_users_to_view_description>false</force_users_to_view_description>
            <feature_on_main_page>false</feature_on_main_page>
            <self_service_categories>
                <category>
                    <name>%POLICY_CATEGORY%</name>
                    <display_in>true</display_in>
                    <feature_in>false</feature_in>
                </category>
            </self_service_categories>
        </self_service>
        <package_configuration>
            <packages>
                <size>2</size>
                <package>
                    <name>%pkg_name%</name>
                    <action>Install</action>
                </package>
                <package>
                    <name>%EXTRA_PKG%</name>
                    <action>Install</action>
                </package>
            </packages>
        </package_configuration>
        <scripts>
            <size>1</size>
            <script>
                <name>%SCRIPT_NAME%</name>
                <priority>After</priority>
                <parameter4/>
                <parameter5/>
                <parameter6/>
                <parameter7/>
                <parameter8/>
                <parameter9/>
                <parameter10/>
                <parameter11/>
            </script>
        </scripts>
        <maintenance>
            <recon>true</recon>
        </maintenance>
    </policy>