Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.CiscoJabber
ParentRecipe: com.github.joshua-d-miller.download.ciscojabber
MinimumVersion: '2.3'

Input:
  NAME: Cisco Jabber

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expanded"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expanded/CiscoJabberInstaller.pkg/payload"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/%NAME%.app/Contents/Info.plist"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%found_filename%"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/*.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/expanded"