Description: |
  Downloads the latest verison of AutoCAD from a local file share.
  
  Supports the new format found with AutoCAD 2021."
Identifier: com.github.mlbz521.download.AutoCAD

Input:
  NAME: AutoCAD
  SEARCH_STRING: AutoCAD
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /path/to/offline/repository
  VERSION_STRING_SEPARATOR: '-'
  MAX_FOLDER_DEPTH: '1'

Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    major_version: '%MAJOR_VERSION%'
    max_depth: '%MAX_FOLDER_DEPTH%'
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    version_separator: '%VERSION_STRING_SEPARATOR%'

- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.dmg'

- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%found_filename%'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%app_name%'
    overwrite: 'true'
    source_path: '%found_filename%/%app_name%'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%app_name%'
    requirement: identifier "com.autodesk.AutoCAD%found_major_version%.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XXKJ396S2Y

- Processor: EndOfCheckPhase
