Description: |
  Downloads the Staged version of Browzwear Lotta from a local file share.
Identifier: com.github.5kinner-recipes.download.BrowzwearLotta

Input:
  NAME: Lotta
  SEARCH_STRING: Lotta
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /path/to/offline/repository
  VERSION_STRING_SEPARATOR: '-'
  MAX_FOLDER_DEPTH: '1'

Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    major_version: '%MAJOR_VERSION%'
    max_depth: '%MAX_FOLDER_DEPTH%'
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    version_separator: '%VERSION_STRING_SEPARATOR%'

- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.dmg'

- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%found_filename%'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%app_name%'
    overwrite: 'true'
    source_path: '%found_filename%/%app_name%'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%app_name%'
