Description: |
  Downloads the Staged version of Browzwear Lotta from a local file share.
Identifier: com.github.5kinner-recipes.download.BrowzwearLotta
MinimumVersion: "2.3"

Input:
  LOCAL_REPO: /path/to/folder
  LIST_NAME: App Name
  VENDOR: Vendor

Process:
  - Processor: com.github.eth-its-recipes.processors/SubDirectoryList
    Arguments:
      root_path: "%LOCAL_REPO%/%VENDOR%/%LIST_NAME%"

  - Processor: com.github.eth-its-recipes.processors/LocalRepoUpdateChecker
    Arguments:
      RECIPE_CACHE_DIR: "%RECIPE_CACHE_DIR%"
      found_files: "%found_filenames%"

  - Processor: URLDownloader
    Comment: "Downloads the file from the source repo to the AutoPkg cache"
    Arguments:
      url: file://%root_path%/%version%/%latest_file%.dmg

  - Processor: EndOfCheckPhase