Description: |
  Downloads the Staged version of Browzwear Lotta from a local file share.
Identifier: com.github.5kinner-recipes.download.BrowzwearLotta

Input:
  NAME: Lotta

Process:
- Processor: URLDownloader
  Arguments:
    PKG: '/Path/to/folder/'
    url: ''
