Description: |
  Downloads the Staged version of Browzwear Lotta from a local file share.
Identifier: com.github.5kinner-recipes.download.BrowzwearLotta

Input:
  NAME: Lotta
  PACKAGE_LOCATION: /path/to/folder/
Process:
- Processor: URLDownloader
  Arguments:
    PKG: '%PACKAGE_LOCATION%'
    url: ''
