Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.BrowzwearVStitcherPROD
MinimumVersion: '2.3'

Input:
  NAME: VStitcher
  CATEGORY: Applications
  TESTER_USERNAME: TESTING
  AD_GROUP: AD Group1
  AD_GROUP2: AD Group2
  POLICY_CATEGORY: UNTESTED
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy_selfservice.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: VStitcher2022.png
  RECIPE_IDENTIFIER: local.recipe.identifier
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.preprocessors/LastRecipeRunChecker
  Arguments:
    recipeoverride_identifier: '%RECIPE_IDENTIFIER%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"

