Description: PKG Recipe using Parent download recipe
Identifier: com.github.5kinner-recipes.pkg.SalesforceCLI
ParentRecipe: com.github.dataJAR-recipes.download.Salesforce CLI
MinimumVersion: '2.3'

Input:
  NAME: SalesforceCLI

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader
    Arguments:
      source_pkg: "%pathname%/*.pkg"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%pathname%/*.pkg"
