Description: Downloads the latest verison of Enscape from a local file.
Identifier: com.github.5kinner-recipes.download.Enscape

Input:
  NAME: Enscape
  SEARCH_STRING: Enscape
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /Path/to/fileshare/
  VERSION_STRING_SEPARATOR: '_'
  MAX_FOLDER_DEPTH: '2'

Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    major_version: '%MAJOR_VERSION%'
    max_depth: '%MAX_FOLDER_DEPTH%'
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    version_separator: '%VERSION_STRING_SEPARATOR%'

- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.dmg'

- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%found_filename%/*.app'

- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%app_name%'
    overwrite: 'true'
    source_path: '%found_filename%/%app_name%'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%app_name%'
    requirement: identifier app and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S82VRC8B76

- Processor: EndOfCheckPhase