Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.upload.ZoomRooms
ParentRecipe: com.github.homebysix.pkg.ZoomPresence
MinimumVersion: '2.3'

Input:
  CATEGORY: Zoom

Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: ZoomPresence