Description: Packages the latest Photo Mechanic application.
Identifier: com.github.5kinner-recipes.pkg.PhotoMechanic
ParentRecipe: com.github.poundbangbash.eholtam-recipes.download.photomechanic

Input:
  NAME: PhotoMechanic

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Photo Mechanic %MAJOR_VERSION%.app'
    overwrite: true
    source_path: '%pathname%/Photo Mechanic %MAJOR_VERSION%.app'

- Processor: Versioner
  Arguments:
    input_plist_path: '%pkgroot%/Applications/Photo Mechanic %MAJOR_VERSION%.app/Contents/Info.plist'
    plist_version_key: CFBundleInfoDictionaryVersion

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.github.autopkg.camerabits.photomechanic.pkg
      options: purge_ds_store
      pkgname: '%NAME%-%version%.%build%'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
      pkgtype: flat
      version: '%version%.%build%'
