Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: local.jamf.GoogleChrome
ParentRecipe: local.pkg.GoogleChrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  CATEGORY: JamfUploader
  GROUP_NAME: JamfUploader-%NAME%-update-smart-regex
  GROUP_TEMPLATE: Smart_Group_Update_Testing_Regex.xml
  VERSION_CRITERION: Application Version
  TESTING_GROUP_NAME: JamfUploaderTEST
  POLICY_CATEGORY: JamfUploader
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy_selfservice.xml
  SELF_SERVICE_DISPLAY_NAME: PILOT - Install Latest AutoPKG %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: Chrome2022.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
