Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.Wacom
ParentRecipe: com.github.jazzace.pkg.WacomIntuosProTabletDriver
MinimumVersion: '2.3'

Input:
  NAME: Wacom Drivers
  CATEGORY: Applications
  GROUP_NAME: AutoPKG - PILOT-%NAME%-smart
  GROUP_TEMPLATE: Smart_Group_Update_Testing.xml
  VERSION_CRITERION: Application Version
  TESTING_GROUP_NAME: TESTING_GROUP_NAME
  POLICY_CATEGORY: UNTESTED
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy_selfservice.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: Wacom2022.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
