Description: Testing of Google Chrome Recipe
Identifier: com.github.5kinner-recipes.pkg.Zoom
ParentRecipe: com.github.homebysix.pkg.Zoom
MinimumVersion: '2.3'

Input:
  NAME: Zoom IT Client

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%jamfversion%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
