Description: Downloads and creates a PKG of PyCharm Professional then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.PyCharmPE
ParentRecipe: com.github.bnpl.autopkg.download.pycharmpe
MinimumVersion: '2.3'

Input:
  NAME: IntelliJ

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: "%pathname%/*.app"
    pkg_path: "%RECIPE_CACHE_DIR%/%app_name%-PE-%version%.pkg"