Description: Downloads and creates a PKG of PyCHarm Professional then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.PyCharmPE
ParentRecipe: com.github.bnpl.autopkg.download.pycharmpe
MinimumVersion: '2.3'

Input:
  NAME: IntelliJ

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: "%pathname%/*.app"