Description: Downloads the latest Gravity Sketch and creates a package and uploads to jamf.
Identifier: com.github.5kinner-recipes.jamf.GravitySketch
ParentRecipe: com.github.5kinner-recipes.pkg.GravitySketch
MinimumVersion: '2.3'

Input:
  NAME: Gravity Sketch
  CATEGORY: Applications
  TESTER_USERNAME: TESTER
  AD_GROUP: AD Group1
  AD_GROUP2: AD Group2
  POLICY_CATEGORY: Applications
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy_selfservice.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: GravitySketch.png
  EXTRA_PKG: Name
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "Gravity Sketch"
