Description: Downloads the latest Gravity Sketch and creates a package.
Identifier: com.github.5kinner-recipes.pkg.GravitySketch
ParentRecipe: com.github.5kinner-recipes.download.GravitySketch
MinimumVersion: '2.3'

Input:
  NAME: Gravity Sketch

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/GravitySketch.app'
    source_path: '%pathname%/GravitySketch.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.gravity.sketch.pkg
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
