Description: Downloads and creates a PKG of SecureCRT then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.SecureCRT
MinimumVersion: '2.3'

Input:
  NAME: SecureCRT

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: \d+.\d+.\d+
    url: https://www.vandyke.com/cgi-bin/download_form_1.php?pid=scrt_mac_arm64_
    result_output_var_name: url

- Processor: URLDownloaderPython
  Arguments:
    url: %url%

