Description: Downloads and creates a PKG of SecureCRT then uploads to Jamf
Identifier: com.github.5kinner-recipes.download.SecureCRT
MinimumVersion: '2.3'

Input:
  NAME: SecureCRT
  SEARCH_STRING: CLO
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /Path/to/fileshare/
  VERSION_STRING_SEPARATOR: '_'
  MAX_FOLDER_DEPTH: '2'

Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    major_version: '%MAJOR_VERSION%'
    max_depth: '%MAX_FOLDER_DEPTH%'
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    version_separator: '%VERSION_STRING_SEPARATOR%'

- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.dmg'