Description: Creates pkg out of DMG
Identifier: com.github.5kinner-recipes.pkg.Modo
ParentRecipe: com.github.5kinner-recipes.download.Modo
MinimumVersion: '2.3'

Input:
  NAME: Modo

Process:
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/*.dmg'

- Processor: com.github.homebysix.FindAndReplace/FindAndReplace
  Arguments:
    find: "_macOS"
    input_string: "%version%"
    replace: ""

- Processor: AppPkgCreator
  Arguments:
    version: '%output_string%'
    app_path: '%found_filename%/*%version%.app'