Description: Creates pkg out of DMG
Identifier: com.github.5kinner-recipes.pkg.Modo
ParentRecipe: com.github.5kinner-recipes.download.Modo
MinimumVersion: '2.3'

Input:
  NAME: Modo

Process:
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/*.dmg'

- Processor: com.github.jazzace.processors/TextSearcher
  Arguments:
    re_pattern: Modo\d+\.\d+v\d+
    result_output_var_name: "shortversion"
    text_in: "%found_basename%"

- Processor: AppPkgCreator
  Arguments:
    version: '%output_string%'
    app_path: '%found_filename%/%shortversion%.app'