Description: Creates pkg out of DMG
Identifier: com.github.5kinner-recipes.pkg.Modo
ParentRecipe: com.github.5kinner-recipes.download.Modo
MinimumVersion: '2.3'

Input:
  NAME: Modo

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR/*.dmg'