Description: Downloads the latest version of Wacom Tablet drivers for macOS.
Identifier: com.github.5kinner-recipes.download.Wacom
MinimumVersion: '2.3'

Input:
  NAME: Wacom Drivers
  DOWNLOAD_PATTERN: (?P&lt;url&gt;https?://.*\.?wacom\.com/.*/drivers?/mac/pro[^/]*/WacomTablet_(?P&lt;version&gt;[\w\d\.-]+)\.dmg)
  DOWNLOAD_URL: https://www.wacom.com/en-us/support/product-support/drivers
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/16.6 Safari/605.1.15

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%DOWNLOAD_PATTERN%'
    url: '%DOWNLOAD_URL%'
    request_headers: 
      user_agent: '%USER_AGENT%'

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%url%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Wacom Technology Corp. (EG27766DY7)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/Install Wacom Tablet.pkg'