Description: Downloads the Wacom Drivers version and creates a PKG
Identifier: com.github.5kinner-recipes.pkg.Wacom
ParentRecipe: com.github.rustymyers.download.WacomTablet
MinimumVersion: '2.3'

Input:
  NAME: Wacom Drivers

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%/*.pkg"
