Description: Recipe using Parent download recipe and packages then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.Keyshot12
ParentRecipe: com.github.5kinner-recipes.download.Keyshot12
MinimumVersion: '2.3'

Input:
  NAME: Keyshot 12

Process:
  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: keyshot_mac64_(\d+\.\d+\_\d+\.\d+\.\d+\.\d+)\.pkg
      result_output_var_name: "version"
      text_in: "%pathname%"