Description: Downloads the latest version of KeyShot 12.
Identifier: com.github.5kinner-recipes.download.Keyshot12
MinimumVersion: '2.3'

Input:
  NAME: KeyShot12

Process:
- Processor: URLDownloader
  Arguments:
    url: https://www.keyshot.com/download/357619/
    filename: '%NAME%.pkg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Luxion, Inc (W7B24M74T3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'