Description: Downloads the latest version of KeyShot Network Rendering 12.
Identifier: com.github.5kinner-recipes.download.KeyshotNetworkRendering12
MinimumVersion: '2.3'

Input:
  NAME: KeyShotNetworkRendering

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (https://www\.keyshot\.com/download/\d{6}/\?tmstv=\d+)"&gt;Keyshot - macOS
    result_output_var_name: url
    url: https://www.keyshot.com/resources/downloads/

- Processor: URLDownloader
  Arguments:
    prefetch_filename: 'true'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Luxion, Inc (W7B24M74T3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'