Description: Downloads the latest version of KeyShot 13.
Identifier: com.github.5kinner-recipes.download.KeyshotNetworkRendering13
MinimumVersion: '2.3'

Input:
  NAME: KeyShot 13

Process:
- Processor: URLDownloader
  Arguments:
    url: https://www.keyshot.com/download/370770/

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Luxion, Inc (W7B24M74T3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'