Description: Downloads the latest version of KeyShot 11.
Identifier: com.github.5kinner-recipes.download.Keyshot11
MinimumVersion: '2.3'

Input:
  NAME: KeyShot 11

Process:

- Processor: URLDownloader
  Arguments:
    url: https://download.keyshot.com/keyshot11/keyshot_mac64_11.3.3.2.pkg

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Luxion, Inc (W7B24M74T3)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'