Description: |
  Downloads the Staged version of IBM SPSS from a local file share.
Identifier: com.github.5kinner-recipes.download.SPSS

Input:
  NAME: SPSS
  SEARCH_STRING: SPSS
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /Path/to/fileshare/
  VERSION_STRING_SEPARATOR: 'SPSSC_'
  MAX_FOLDER_DEPTH: '2'

Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    major_version: '%MAJOR_VERSION%'
    max_depth: '%MAX_FOLDER_DEPTH%'
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    version_separator: '%VERSION_STRING_SEPARATOR%'

- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.pkg'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%found_filename%'
    expected_authority_names:
     - 'Developer ID Installer: International  Business Machines Corp (PETKK2G752)'
     - 'Developer ID Certification Authority'
     - 'Apple Root CA'