Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.FileZilla
ParentRecipe: com.github.5kinner-recipes.download.FileZilla
MinimumVersion: '2.3'

Input:
  NAME: FileZilla

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%pkgroot%/Applications'

- Processor: PlistReader
  Arguments:
    info_path: '%pkgroot%/Applications/FileZilla.app'
    plist_keys:
      CFBundleIdentifier: bundleid
      CFBundleVersion: version

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
