Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.FileZilla
ParentRecipe: com.github.5kinner-recipes.download.FileZilla
MinimumVersion: '2.3'

Input:
  NAME: FileZilla

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Unarchiver
  Arguments:
    archive_path: '%found_filename%'
    destination_path: '%pkgroot%/Applications'

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/*.app'
    requirement: 'identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N"'

- Processor: PlistReader
  Arguments:
    info_path: '%pkgroot%/Applications/FileZilla.app'
    plist_keys:
      CFBundleIdentifier: bundleid
      CFBundleVersion: version

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: '%bundleid%'
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'