Description: Creates a Package of 3D Connexion Software
Identifier: com.github.5kinner-recipes.pkg.3DxWare
ParentRecipe: com.github.5kinner-recipes.download.3DxWare
MinimumVersion: '2.3'

Input:
  NAME: 3DxWare

Process:
  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: \_v(.*)\.
      result_output_var_name: "version"
      text_in: "%pathname%"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%pathname%/*.pkg"

  - Processor: com.github.homebysix.FindAndReplace/FindAndReplace
    Arguments:
      find: "-"
      input_string: "%pkg_path%"
      replace: "."