Description: Creates a Package of 3D Connexion Software
Identifier: com.github.5kinner-recipes.pkg.3DxWare
ParentRecipe: com.github.5kinner-recipes.download.3DxWare
MinimumVersion: '2.3'

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/*.dmg"
