Description: Creates a Package of 3D Connexion Software
Identifier: com.github.5kinner-recipes.pkg.3DxWare
ParentRecipe: com.github.5kinner-recipes.download.3DxWare
MinimumVersion: '2.3'

Input:
  NAME: 3D Connexion Software

Process:
  - Processor: com.github.dataJAR-recipes.Shared Processors/DistributionPkgInfo
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/downloads/*.dmg/*.pkg"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/downloads/*.dmg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"
