Description: Recipe using Parent pkg recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.AdobeCCD
ParentRecipe: com.github.rtrouton.pkg.AdobeCreativeCloudInstallerUniversal
MinimumVersion: '2.3'

Input:
  NAME: Adobe Creative Cloud Desktop
  CATEGORY: Applications
  TESTER_USERNAME: TESTER
  AD_GROUP: AD Group1
  AD_GROUP2: AD Group2
  AD_GROUP3: AD Group3
  AD_GROUP4: AD Group4
  POLICY_CATEGORY: UNTESTED
  POLICY_NAME: Install Latest %NAME%
  TARGET_GROUP_NAME: Corporate Machine
  POLICY_TEMPLATE: Policy_selfservice_TargetGroup_4AD_Groups_andTester.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELFSERVICE_ICON: AdobeCCD.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
    SELF_SERVICE_DESCRIPTION: 'Installs the Latest Version %NAME%


    Version: *%version%*'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "AdobeCreativeCloudInstaller"
