Description: PKG Recipe using Parent download recipe
Identifier: com.github.5kinner-recipes.pkg.AdobeAcrobat
ParentRecipe: com.github.novaksam.download.AdobeAcrobatDCUpdate
MinimumVersion: '2.3'

Input:
  NAME: Adobe Acrobat

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%/*.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/payload.pkg/payload"

  - Processor: com.github.mlbz521.SharedProcessors/ExtractWith7z
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/payload/*.7z"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/unzipped"
      7z_path: "%RECIPE_CACHE_DIR%/unpack/payload.pkg/Scripts/Tools/7zz"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/Adobe Acrobat.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%RECIPE_CACHE_DIR%/unpack/WHAAT.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/payload"