Description: PKG Recipe using Parent download recipe
Identifier: com.github.5kinner-recipes.pkg.AdobeAcrobatReader
ParentRecipe: com.github.novaksam.download.AdobeAcrobatReaderDCUpdates
MinimumVersion: '2.3'

Input:
  NAME: Adobe Acrobat Reader

Process:
  - Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader
    Arguments:
      source_pkg: "%pathname%/*.pkg"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-v%version%.pkg"
      source_pkg: "%pathname%/*.pkg"
