Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.AdobeAcrobat
ParentRecipe: com.github.5kinner-recipes.pkg.AdobeAcrobat
MinimumVersion: '2.3'

Input:
  NAME: Adobe Acrobat
  CATEGORY: My Applications
  GROUP_NAME: AutoPkg - Adobe Acrobat-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Testing_Regex.xml
  TESTING_GROUP_NAME: Testers
  POLICY_NAME: Autopkg Auto Update %NAME%
  POLICY_TEMPLATE: Policy_update-smart-NOselfservice_withCompleteMSG_andTester.xml
  POLICY_CATEGORY: Auto Updating
  TESTER_USERNAME: Tester
  COMPLETE_MSG: Message
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "Adobe Acrobat-v"
    versions_to_keep: 3