Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.AdoberAcrobat
ParentRecipe: com.github.autopkg.pkg.AdobeReader
MinimumVersion: '2.3'

Input:
  NAME: Adobe Acrobat
  CATEGORY: My Applications
  GROUP_NAME: AutoPkg - Adobe Acrobat-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Regex.xml
  POLICY_NAME: Autopkg Auto Update %NAME%
  POLICY_TEMPLATE: Policy_update-smart-NOselfservice_withCompleteMSG.xml
  POLICY_CATEGORY: Auto Updating
  TESTER_USERNAME: Tester
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    policy_category: '%POLICY_CATEGORY%'
    replace_policy: "True"
