Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.Wirecast
ParentRecipe: com.github.foigus.download.Wirecast
MinimumVersion: '2.3'

Input:
  NAME: Wirecast

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%pathname%/*.app"