Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.Chronosync
ParentRecipe: com.github.homebysix.download.ChronoSync
MinimumVersion: '2.3'

Input:
  NAME: Chronosync

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/PkgInfoReader
  Arguments:
    source_pkg: "%pathname%/Install.pkg"

- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_v%version%.pkg'
    source_pkg: '%pathname%/Install.pkg'