Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.Wireshark
ParentRecipe: com.github.homebysix.pkg.Wireshark
MinimumVersion: '2.3'

Input:
  NAME: Wireshark
  CATEGORY: Applications
  POLICY_NAME: Install Wireshark
  GROUP_NAME: AutoPkg - Wireshark-Needs-Update
  GROUP_TEMPLATE: Smart_Group_Update_Regex.xml
  TARGET_GROUP_NAME: Corporate Machine
  TESTER_USERNAME: Tester
  CUSTOM_TRIGGER: Jamf Trigger
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: 'Policy_CustomTrigger_TargetGroup.xml'
    policy_name: '%POLICY_NAME%'
    policy_category: '%CATEGORY%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner