Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.upload.MicrosoftOffice
ParentRecipe: com.github.rtrouton.pkg.MicrosoftOffice365BusinessProSuite
MinimumVersion: '2.3'

Input:
  CATEGORY: Applications

Process:

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "Microsoft_Office"
    versions_to_keep: 3
