Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.MicrosoftTeams
ParentRecipe: com.github.rtrouton.pkg.microsoftteams
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Teams
  CATEGORY: Applications
  POLICY_CATEGORY: Applications
  POLICY_NAME: Install Latest %NAME%
  GROUP_NAME: Corporate Computers
  POLICY_TEMPLATE: Policy_selfservice_Group.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELFSERVICE_ICON: MSTeams2022.png
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"
    SELF_SERVICE_DESCRIPTION: 'Installs the Latest Version %NAME%


    Version: *%version%*'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
  Arguments:
    pkg_name_match: "Microsoft_Teams"
    versions_to_keep: 3