Description: Downloads the latest BrowserStack Local and creates a package.
Identifier: com.github.5kinner-recipes.pkg.BrowserStackLocal
ParentRecipe: com.github.dataJAR-recipes.download.BrowserStackLocal App
MinimumVersion: '2.3'

Input:
  NAME: BrowserStack Local

Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/BrowserStackLocal.app'
    source_path: '%pathname%/BrowserStackLocal.app'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.browserstack.local.pkg
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
