Description: Downloads the latest BrowserStack Local and creates a package.
Identifier: com.github.5kinner-recipes.pkg.BrowserStackLocal
ParentRecipe: com.github.dataJAR-recipes.download.BrowserStackLocal App
MinimumVersion: '2.3'

Input:
  NAME: BrowserStack Local

Process:
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/BrowserStackLocal.app/Contents/info.plist'

- Processor: AppPkgCreator
  Arguments:
    version: '%version%'
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/BrowserStackLocal.app'
