Description: Downloads Poll Everywhere
Identifier: com.github.5kinner-recipes.pkg.PollEverywhere
ParentRecipe: com.github.5kinner-recipes.download.PollEverywhere
MinimumVersion: '2.3'

Input:
  NAME: PollEverywhere

Process:
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/*.app'
    requirement: 'identifier "com.polleverywhere.PollEv-Presenter" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = W48F3X5M8W'

- Processor: Versioner
  Arguments:
    input_plist_path: "%pathname%/*.app/Contents/Info.plist"
    plist_version_key: CFBundleVersion

- Processor: AppPkgCreator
  Arguments:
    app_path: "%pathname%/*.app"