Description: Downloads Poll Everywhere
Identifier: com.github.5kinner-recipes.download.PollEverywhere
MinimumVersion: '2.3'

Input:
  NAME: Poll Everywhere

Process:
- Processor: URLDownloader
  Arguments:
    url: https://www.polleverywhere.com/app.dmg?hsLang=en

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Poll Everywhere, Inc. (W48F3X5M8W)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'

