Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.pkg.Wrike
ParentRecipe: com.github.foigus.download.Wrike
MinimumVersion: '2.3'

Input:
  NAME: Wrike

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%pathname%/*.app"