Description: Recipe using Parent download recipe and then uploads to Jamf
Identifier: com.github.5kinner-recipes.jamf.phocus
ParentRecipe: com.github.neilmartin83.pkg.Phocus
MinimumVersion: '2.3'

Input:
  NAME: Phocus
  CATEGORY: My Applications
  GROUP_NAME: AutoPkg - Phocus-Auto-Update
  GROUP_TEMPLATE: Smart_Group_Update_Regex.xml
  AD_GROUP: AD Group
  TESTER_USERNAME: Tester
  SELF_SERVICE_POLICY_CATEGORY: My Applications
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: |
    Installs the Latest Version %NAME%

    Version: *%version%*
  SELFSERVICE_ICON: Phocus.png
  COMPLETE_MSG: Message
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: 'Policy_selfservice_AD_Group.xml'
    policy_name: 'Install Latest %NAME%'
    policy_category: '%SELF_SERVICE_POLICY_CATEGORY%'
    icon: '%SELFSERVICE_ICON%'
    replace_policy: "True"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: 'Policy_update-smart-NOselfservice_withCompleteMSG.xml'
    policy_name: 'AutoPkg Auto Update %NAME%'
    policy_category: 'Auto Updating'
    replace_policy: "True"
